driver-tests/bpelse/assign/AssignJbi/test/CopyNCNameInvoke/Input.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/1999/XMLSchema"
                   xmlns:tns="http://sun.com/echo/"
                   xmlns="urn:DataType">
 <SOAP-ENV:Header/>
 <SOAP-ENV:Body>
   <NCNamePart>
	<xsd_NCName>encoding</xsd_NCName>
	<optional_NCName>UndefinedNCNameLength23</optional_NCName>
	<repeat_NCName>UndefinedNCNameLength23</repeat_NCName>
	<repeat_NCName>name</repeat_NCName>
   </NCNamePart>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
